In [1]:
#EX1
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David' ,'Eva'],
    'Age' :[25, 30,35,40,22],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70_000, 80_000, 120_000, 90_000, 60_000]
}
df = pd.DataFrame(data)
df.set_index('Name', inplace =  True)
df

         Age         City  Salary
Name
Alice     25     New York   70000
Bob       30  Los Angeles   80000
Charlie   35      Chicago  120000
David     40      Houston   90000
Eva       22      Phoenix   60000

In [2]:
print(df.Salary)
print(df['Salary'])

Name
Alice       70000
Bob         80000
Charlie    120000
David       90000
Eva         60000
Name: Salary, dtype: int64
Name
Alice       70000
Bob         80000
Charlie    120000
David       90000
Eva         60000
Name: Salary, dtype: int64

In [3]:
print(df.loc['Charlie'])

Age            35
City      Chicago
Salary     120000
Name: Charlie, dtype: object

In [4]:
df.iloc[2]

Age            35
City      Chicago
Salary     120000
Name: Charlie, dtype: object

In [5]:
#EX2 
df.loc['Bob':'David',:]

         Age         City  Salary
Name
Bob       30  Los Angeles   80000
Charlie   35      Chicago  120000
David     40      Houston   90000

In [6]:

df.iloc[1:4,:2]

         Age         City
Name
Bob       30  Los Angeles
Charlie   35      Chicago
David     40      Houston

In [7]:
df.loc[['Alice', 'Eva'], ['Age', 'City']]

       Age      City
Name
Alice   25  New York
Eva     22   Phoenix

In [8]:
#EX3-Filterin and modifying data
m = df.loc[:, 'Age']>30
df[m]

         Age     City  Salary
Name
Charlie   35  Chicago  120000
David     40  Houston   90000

In [9]:
a = (df.loc[:, 'City'] == 'New York') | (df.loc[:, 'City']== 'Chicago')
df[a]

         Age      City  Salary
Name
Alice     25  New York   70000
Charlie   35   Chicago  120000

In [10]:
df.loc[df['Salary']>80_000, ['Salary']]

         Salary
Name
Charlie  120000
David     90000

In [11]:
#EX 4
df['Bonus'] =df.loc[:, 'Salary']*0.9
df

         Age         City  Salary     Bonus
Name
Alice     25     New York   70000   63000.0
Bob       30  Los Angeles   80000   72000.0
Charlie   35      Chicago  120000  108000.0
David     40      Houston   90000   81000.0
Eva       22      Phoenix   60000   54000.0

In [12]:
df['Senior'] = df.loc[:, 'Age']>=25 
df

         Age         City  Salary     Bonus  Senior
Name
Alice     25     New York   70000   63000.0    True
Bob       30  Los Angeles   80000   72000.0    True
Charlie   35      Chicago  120000  108000.0    True
David     40      Houston   90000   81000.0    True
Eva       22      Phoenix   60000   54000.0   False

In [13]:
del df['City']

In [14]:
remove_bonus = df.pop('Bonus')
#ikinci defe run etdiyime gore error verdi:(

In [15]:
#EX 5 
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 22],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 120000, 90000, 60000]
}
df = pd.DataFrame(data)
df.set_index('Name', inplace=True)

In [16]:
#ex 6
df.sort_index(axis= 0, ascending = True)

         Age         City  Salary
Name
Alice     25     New York   70000
Bob       30  Los Angeles   80000
Charlie   35      Chicago  120000
David     40      Houston   90000
Eva       22      Phoenix   60000

In [17]:
df.sort_values(by = 'Age', axis = 0, inplace =True)
df

         Age         City  Salary
Name
Eva       22      Phoenix   60000
Alice     25     New York   70000
Bob       30  Los Angeles   80000
Charlie   35      Chicago  120000
David     40      Houston   90000

In [18]:
df.sort_values(by = 'Salary', axis = 0, inplace = True)
df

         Age         City  Salary
Name
Eva       22      Phoenix   60000
Alice     25     New York   70000
Bob       30  Los Angeles   80000
David     40      Houston   90000
Charlie   35      Chicago  120000

In [19]:
#EX7
import numpy as np
np.random.seed(42)
grades = pd.DataFrame(
    np.random.randint(50,100, size= (5,3)),
    columns = ['Math', 'Science', 'English'],
    index = ['Alice', 'Bob', 'Charlie', 'David', 'Eva']
)
grades

         Math  Science  English
Alice      88       78       64
Bob        92       57       70
Charlie    88       68       72
David      60       60       73
Eva        85       89       73

In [20]:
grades = grades.add(5)
grades

         Math  Science  English
Alice      93       83       69
Bob        97       62       75
Charlie    93       73       77
David      65       65       78
Eva        90       94       78

In [21]:
grades.mean(axis= 1)

Alice      81.666667
Bob        78.000000
Charlie    81.000000
David      69.333333
Eva        87.333333
dtype: float64

In [22]:
grades.mean()

Math       87.6
Science    75.4
English    75.4
dtype: float64

In [23]:
#EX8-Data Cleaning
df_missing = pd.DataFrame({
    'A':[1,2,np.nan,4],
    'B':[5,np.nan,np.nan,8],
    'C':[10,11,12,13]
})
df_missing.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False  False

In [24]:
df_missing.dropna(axis = 'rows', how= 'any')

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  13

In [25]:
df_missing.reset_index(drop=True).fillna(0, axis= 'rows')

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  11
2  0.0  0.0  12
3  4.0  8.0  13

In [26]:

df_missing.fillna(df_missing.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  11
2  2.333333  6.5  12
3  4.000000  8.0  13

In [27]:
#EX9-Handling duplicates
df_dup  = pd.DataFrame({
    'ID': [1,2,2,3,4,4,],
    'Value': ['A', 'B', 'B', 'C', 'D', 'D']
})
df_dup.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [28]:
df_dup.drop_duplicates()

   ID Value
0   1     A
1   2     B
3   3     C
4   4     D

In [34]:
#EX10- Data Type Conversion
df_str = pd.DataFrame({
    'Price': ['100', '200', '300', '400']
})
df_str.dtypes
df_str = df_str['Price'].astype(int)
df_str.dtype

dtype('int64')